<a href="https://colab.research.google.com/github/Manmith1321/B19_1321/blob/main/LAB_04.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [60]:
import pandas as pd
#creating a series from list
data = [1,2,3,4,5]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [61]:
#series with custom index
import pandas as pd
data = [1,2,3,4,5]
index = ['a','b','c','d','e']
series = pd.Series(data,index=index)
print(series)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [62]:
import pandas as pd
a={"name":['manmith','dinesh','jess','kruti'],"age":[20,21,22,23],"city":["hyd","wgl","delhi","mumbai"]}
df=pd.DataFrame(a)
print(df)

      name  age    city
0  manmith   20     hyd
1   dinesh   21     wgl
2     jess   22   delhi
3    kruti   23  mumbai

In [63]:
print(df['name'])

0    manmith
1     dinesh
2       jess
3      kruti
Name: name, dtype: object

In [64]:
print(df[["name","age"]])

      name  age
0  manmith   20
1   dinesh   21
2     jess   22
3    kruti   23

In [65]:
print(df.loc[0])

name    manmith
age          20
city        hyd
Name: 0, dtype: object

In [66]:
print(df.loc[[0,1]])

      name  age city
0  manmith   20  hyd
1   dinesh   21  wgl

In [67]:
print(df.iloc[0])

name    manmith
age          20
city        hyd
Name: 0, dtype: object

In [68]:
df['salary']=[4000,3000,2000,1000]

print(df)

      name  age    city  salary
0  manmith   20     hyd    4000
1   dinesh   21     wgl    3000
2     jess   22   delhi    2000
3    kruti   23  mumbai    1000

In [69]:
df = df.drop('city', axis=1)
print(df)

      name  age  salary
0  manmith   20    4000
1   dinesh   21    3000
2     jess   22    2000
3    kruti   23    1000

In [70]:
print(df[df['age']>20])

     name  age  salary
1  dinesh   21    3000
2    jess   22    2000
3   kruti   23    1000

In [71]:
print(df["age"].mean())

21.5

In [72]:
print(df["age"].max())

23

In [73]:
print(df["age"].min())

20

In [74]:
student_data={"student-ID":[1,2,3,4,5],"Name":["manmith","dinesh","mahathi","jess","kruti"],"marks":[96,98,97,95,99],"Dep":["CSE","ECE","MECH","CSE","CSE-M"]}
df=pd.DataFrame(student_data)
print(df)

   student-ID     Name  marks    Dep
0           1  manmith     96    CSE
1           2   dinesh     98    ECE
2           3  mahathi     97   MECH
3           4     jess     95    CSE
4           5    kruti     99  CSE-M

In [75]:
# find students with marks>95
print(df[df['marks']>95])

   student-ID     Name  marks    Dep
0           1  manmith     96    CSE
1           2   dinesh     98    ECE
2           3  mahathi     97   MECH
4           5    kruti     99  CSE-M

In [76]:
#average marks
print(df['marks'].mean())

97.0

In [77]:
#add new column
df["result"]=['pass'if x>=50 else 'fail' for x in df["marks"]]
print(df)

   student-ID     Name  marks    Dep result
0           1  manmith     96    CSE   pass
1           2   dinesh     98    ECE   pass
2           3  mahathi     97   MECH   pass
3           4     jess     95    CSE   pass
4           5    kruti     99  CSE-M   pass

In [78]:
student_data={"srollno":[1,2,3,4,5],"sName":["manmith","dinesh","mahathi","jess","kruti"],'m1':[96,88,57,55,99],'m2':[90,41,89,76,99],'m3':[99,89,69,79,59]}
df=pd.DataFrame(student_data)
print(df)

   srollno    sName  m1  m2  m3
0        1  manmith  96  90  99
1        2   dinesh  88  41  89
2        3  mahathi  57  89  69
3        4     jess  55  76  79
4        5    kruti  99  99  59

In [79]:
df["total"]=df['m1']+df['m2']+df['m3']
print(df)

   srollno    sName  m1  m2  m3  total
0        1  manmith  96  90  99    285
1        2   dinesh  88  41  89    218
2        3  mahathi  57  89  69    215
3        4     jess  55  76  79    210
4        5    kruti  99  99  59    257

In [80]:
df["result"]=['pass'if x>=50 else 'fail' for x in df["total"]]
print(df)

   srollno    sName  m1  m2  m3  total result
0        1  manmith  96  90  99    285   pass
1        2   dinesh  88  41  89    218   pass
2        3  mahathi  57  89  69    215   pass
3        4     jess  55  76  79    210   pass
4        5    kruti  99  99  59    257   pass

In [81]:
df["average"]=df['total']/3
print(df)

   srollno    sName  m1  m2  m3  total result    average
0        1  manmith  96  90  99    285   pass  95.000000
1        2   dinesh  88  41  89    218   pass  72.666667
2        3  mahathi  57  89  69    215   pass  71.666667
3        4     jess  55  76  79    210   pass  70.000000
4        5    kruti  99  99  59    257   pass  85.666667